# Processing data with Pandas

## Agenda:


* Why Pandas?

* Series and DataFrames.

* Indexing.

* Reading and saving data.

* Missing data.

* Basic operations.

* Plots.

* Performance tips.

 (https://media.giphy.com/media/DBPEwTU6klcac/giphy.gif)

 (There is an overhead in loading the data into the data frame. This is compensated when there is a lot of processing needed. However, it’s not advised to use pandas and load the data into a data frame for one calculation.) Mencionar alternativas?

TODO: AGREGAR CODIGO QR CON LINK AL REPOSITORIO?

## Why Pandas?


- Open source Python library (age ~ 11 years).

(Es una libreria de Python open source que ya tiene unos 11 años desde su primer release)

- It became almost a standard for performing data analysis in Python.

(Es practicamente un estandar para realizar analisis de datos de manera rapida en Python)

- It's made over numpy.

(Otra libreria de Python que implementa arrays multidimensionales de forma eficiente y es la 
base para muchos de los paquetes científicos de Python)

- It has high level data structures.

(Esto son las Series y Dataframes lo que hace mas ameno trabajar con esta herramienta).

## Series and Dataframes

In [1]:
python_list = [1, 2, 3, 4]

python_list[2]

3

In [2]:
python_list[1:-1]

[2, 3]

In [3]:
python_dict = {'a': 1, 'b': 2, 'c': 3, 'd': 4}

python_dict['c']

3

- Series: one dimensional labeled array

In [4]:
import pandas
serie = pandas.Series([1, 2, 3, 4],
                       index=['a', 'b', 'c', 'd'])
serie

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
serie[1:-1]

b    2
c    3
dtype: int64

In [6]:
serie['c']

3

In [7]:
serie = serie + 1
serie

a    2
b    3
c    4
d    5
dtype: int64

In [8]:
serie + pandas.Series([100, 100, 200, 200], index=['c', 'd', 'a', 'b'])

a    202
b    203
c    104
d    105
dtype: int64

In [9]:
serie.mean()

3.5

In [10]:
serie.std()

1.2909944487358056

In [12]:
print(type(serie.values))
serie.values

<class 'numpy.ndarray'>

array([2, 3, 4, 5])

- Dataframe: two dimensional labeled data structure with columns of potentially different types

In [17]:
df = pandas.DataFrame({'name': ['John', 'Peter', 'David', 'Michael'],
                       'number': serie,
                       'birthdate': ['2010-01-02', float('NaN'), '2011-05-23', 0.]})
df

      name  number   birthdate
a     John       2  2010-01-02
b    Peter       3         NaN
c    David       4  2011-05-23
d  Michael       5           0

## Indexing

- By position

In [18]:
df.iloc[2]

name              David
number                4
birthdate    2011-05-23
Name: c, dtype: object

- By label

In [19]:
df.loc['c']

name              David
number                4
birthdate    2011-05-23
Name: c, dtype: object

- Boolean indexing

In [21]:
df[df['name'] == 'David']

    name  number   birthdate
c  David       4  2011-05-23

## Reading and saving data

(Pandas viene preparado para interactuar con varios formatos de datos, entre ellos CSV, JSON, Excel, HDF5, pickle, SQL y varios más.)

<table class="colwidths-given docutils" border="1">
<colgroup>
<col width="12%">
<col width="40%">
<col width="24%">
<col width="24%">
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="https://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

Some useful parameters of *read_csv()* function:

- filepath_or_buffer: required. Any valid string path is acceptable. The string could be a URL.
- parse_dates: columns to be parsed as dates.
- date_parser: function used to parsing dates.
- usecols: return a subset of the columns.
- dtype: data type for data or columns.
- na_values: additional strings to recognize as NA/NaN.

Example: 

### *Housing global price indices*. 


- Dataset comes from [Bank For International Settlements BIS](http://www.bis.org/statistics/pp.htm).

In [96]:
df = pandas.read_csv('data/housing_global_price_indices.csv.gz', parse_dates=['date'])

### Missing data

In [97]:
print(df.shape)
df.head()

(12627, 3)

        date                    country  price_index
0 1966-03-31  Emerging market economies          NaN
1 1966-03-31         Advanced economies          NaN
2 1966-03-31       United Arab Emirates          NaN
3 1966-03-31                    Austria          NaN
4 1966-03-31                  Australia          NaN

In [98]:
df_clean = df.dropna()
df_clean.shape

(4561, 3)

Explicar que decidir como tratar los valores faltantes muchas veces es algo no trivial y depende mucho del problema.

- En lugar de remover:

In [99]:
df_clean = df.fillna(0)
df_clean.head()

        date                    country  price_index
0 1966-03-31  Emerging market economies          0.0
1 1966-03-31         Advanced economies          0.0
2 1966-03-31       United Arab Emirates          0.0
3 1966-03-31                    Austria          0.0
4 1966-03-31                  Australia          0.0

- fillna(promedio, mediana, moda por año). (mas adelante implementarlo utilizando el groupby)

- Regresion por año y por pais.

In [100]:
df = df.dropna()
df = df.reset_index(drop=True)

In [101]:
df.describe()

       price_index
count  4561.000000
mean     90.835694
std      26.251676
min      21.870000
25%      76.350000
50%      94.700000
75%     103.520000
max     218.090000

In [102]:
df['country'].value_counts()[:10]

South Africa      207
United Kingdom    197
Switzerland       191
Canada            190
United States     167
New Zealand       151
Hong Kong SAR     151
Euro area         150
Korea             127
Sweden            126
Name: country, dtype: int64

In [103]:
df.sample(10)

           date         country  price_index
1389 2002-06-30       Indonesia       140.26
3327 2012-06-30          Russia        79.68
3680 2013-12-31  Macedonia, FYR        83.18
97   1974-09-30  United Kingdom        33.03
2240 2007-12-31         Iceland       149.07
872  1995-12-31          Norway        42.20
2040 2006-12-31   Hong Kong SAR        67.17
2301 2008-03-31           Malta       110.06
252  1981-09-30  United Kingdom        31.80
3668 2013-12-31       Indonesia       105.37

- Apply / map

- Concatenate

- Merge

- Group by

In [104]:
df_gb = df.groupby(df['date'].dt.year)

In [146]:
price_stats_by_year = df_gb['price_index'].agg(['count', 'mean', 'median', 'std', 'min', 'max'])
price_stats_by_year.head()

      count       mean  median        std    min    max
date
1966      4  56.462500  56.470   0.559606  55.86  57.05
1967      4  64.905000  65.165   1.436071  63.09  66.20
1968      7  47.728571  64.870  23.379287  22.50  68.94
1969      8  47.007500  46.060  26.132157  22.38  73.34
1970     16  53.925625  57.335  25.543817  21.87  80.06

In [151]:
price_stats_by_year_more_than_200 = price_stats_by_year[price_stats_by_year['count'] > 200]
price_stats_by_year_more_than_200

      count        mean   median        std    min     max
date
2008    227  107.030264  103.140  21.122224  66.44  207.87
2009    236   99.767797  100.085   7.872156  73.24  126.26
2010    244  100.003607  100.020   1.991602  93.34  106.25
2011    244   98.721885   99.305   7.388907  72.36  117.47
2012    244   98.596025   99.535  12.523072  68.41  140.26
2013    244  100.355697  100.135  17.527574  65.86  156.20
2014    244  103.363361  100.830  21.069284  66.42  173.42
2015    244  106.569713  104.700  23.044863  60.81  171.91
2016    244  110.237705  107.515  24.272043  55.16  178.72

In [136]:
def normalize(serie):
    return serie.mean() - serie.std()

In [144]:
price_norm_by_year = df_gb['price_index'].agg(normalize).to_frame()
price_norm_by_year.rename(columns={'price_index': 'norm_price_index'}, inplace=True)
price_norm_by_year.head()

      norm_price_index
date
1966         55.902894
1967         63.468929
1968         24.349284
1969         20.875343
1970         28.381808

- Merge

In [157]:
price_stats_by_year_more_than_200.merge(price_norm_by_year, how='left',
                                        left_index=True, right_index=True)

      count        mean   median        std    min     max  norm_price_index
date
2008    227  107.030264  103.140  21.122224  66.44  207.87         85.908040
2009    236   99.767797  100.085   7.872156  73.24  126.26         91.895640
2010    244  100.003607  100.020   1.991602  93.34  106.25         98.012005
2011    244   98.721885   99.305   7.388907  72.36  117.47         91.332978
2012    244   98.596025   99.535  12.523072  68.41  140.26         86.072952
2013    244  100.355697  100.135  17.527574  65.86  156.20         82.828123
2014    244  103.363361  100.830  21.069284  66.42  173.42         82.294076
2015    244  106.569713  104.700  23.044863  60.81  171.91         83.524850
2016    244  110.237705  107.515  24.272043  55.16  178.72         85.965662

      count        mean   median        std    min     max
date
2008    227  107.030264  103.140  21.122224  66.44  207.87
2009    236   99.767797  100.085   7.872156  73.24  126.26
2010    244  100.003607  100.020   1.991602  93.34  106.25
2011    244   98.721885   99.305   7.388907  72.36  117.47
2012    244   98.596025   99.535  12.523072  68.41  140.26
2013    244  100.355697  100.135  17.527574  65.86  156.20
2014    244  103.363361  100.830  21.069284  66.42  173.42
2015    244  106.569713  104.700  23.044863  60.81  171.91
2016    244  110.237705  107.515  24.272043  55.16  178.72

In [60]:
gdp = (pandas.DataFrame([('USA', 'Americas', 19_390_604, 20_035_183, 47., 49.),
                        ('China', 'Asia', 12_237_700, 15_554_902, 46.5, 48.),
                        ('Japan', 'Asia', 4_872_137, 4_893_502, 37.9, 36.2),
                        ('Germany', 'Europe', 3_677_439, 3_732_192, 27., 27.3),
                        ('UK', 'Europe', 2_622_434, 2_591_883, 32.4, 34.1),
                        ('India', 'Asia', 2_597_491, 2_712_658, 35.1, 37.9)],
                       columns=['country', 'continent', None, None, None, None])
             .set_index(['continent', 'country']))
gdp.columns = [['gdp', 'gdp', 'gini', 'gini'], [2017, 2018] * 2]
gdp

                        gdp            gini
                       2017      2018  2017  2018
continent country
Americas  USA      19390604  20035183  47.0  49.0
Asia      China    12237700  15554902  46.5  48.0
          Japan     4872137   4893502  37.9  36.2
Europe    Germany   3677439   3732192  27.0  27.3
          UK        2622434   2591883  32.4  34.1
Asia      India     2597491   2712658  35.1  37.9

In [67]:
gdp.loc['Asia']

              gdp            gini
             2017      2018  2017  2018
country
China    12237700  15554902  46.5  48.0
Japan     4872137   4893502  37.9  36.2
India     2597491   2712658  35.1  37.9

In [68]:
gdp.loc['Asia', 'gdp']

             2017      2018
country
China    12237700  15554902
Japan     4872137   4893502
India     2597491   2712658

In [72]:
gdp

                        gdp            gini
                       2017      2018  2017  2018
continent country
Americas  USA      19390604  20035183  47.0  49.0
Asia      China    12237700  15554902  46.5  48.0
          Japan     4872137   4893502  37.9  36.2
Europe    Germany   3677439   3732192  27.0  27.3
          UK        2622434   2591883  32.4  34.1
Asia      India     2597491   2712658  35.1  37.9

In [74]:
gdp.xs(2018, axis='columns', level=1) # Returns a cross-section

                        gdp  gini
continent country
Americas  USA      20035183  49.0
Asia      China    15554902  48.0
          Japan     4893502  36.2
Europe    Germany   3732192  27.3
          UK        2591883  34.1
Asia      India     2712658  37.9

In [77]:
countries = pandas.read_csv('https://github.com/datapythonista/pandas_ecosystem/raw/master/data/countries.csv.gz',
                            sep=';')
countries

,Country (en),Country (de),Country (local),Country code,Continent,Capital,Population,Area,Coastline,Government form,Currency,Currency code,Dialing prefix,Birthrate,Deathrate,Url
0,Albania,Albanien,Shqipëria,AL,Europe,Tirana,2873457,28750,362,Parliamentary republic,Lek,ALL,355,11.8,7.4,https://www.laenderdaten.info/Europa/Albanien/...
1,Angola,Angola,Angola,AO,Africa,Luanda,29784193,1246700,1600,Presidential republic,Kwanza,AOA,244,41.8,8.5,https://www.laenderdaten.info/Afrika/Angola/in...
2,Equatorial Guinea,Äquatorialguinea,Guinea Ecuatorial,GQ,Africa,Malabo,1267689,28050,296,Presidential republic,Central African Franc,XAF,240,34.1,10.2,https://www.laenderdaten.info/Afrika/Aequatori...
3,Azerbaijan,Aserbaidschan,Azärbaycan,AZ,Asia,Baku,9862429,86600,0,Presidential republic,Manat,AZN,994,16.3,5.8,https://www.laenderdaten.info/Asien/Aserbaidsc...